results/data/run1/native-db/erik-laptop/quarkus-io-thread-10000-MEASURE.wrk2.out
Running 1m test @ http://erik-pc.local:8080/fruits
  4 threads and 100 connections
  Thread calibration: mean lat.: 3.422ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.278ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.200ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.455ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.30ms    1.10ms  13.22ms   72.07%
    Req/Sec     2.64k   402.96     5.00k    72.99%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    3.37ms
 75.000%    4.05ms
 90.000%    4.50ms
 99.000%    5.80ms
 99.900%    9.56ms
 99.990%   10.86ms
 99.999%   12.36ms
100.000%   13.22ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.547     0.000000            1         1.00
       1.852     0.100000        49897         1.11
       2.413     0.200000        99843         1.25
       2.765     0.300000       149792         1.43
       3.069     0.400000       199572         1.67
       3.367     0.500000       249630         2.00
       3.511     0.550000       274469         2.22
       3.651     0.600000       299411         2.50
       3.789     0.650000       324532         2.86
       3.919     0.700000       349304         3.33
       4.049     0.750000       374412         4.00
       4.115     0.775000       387002         4.44
       4.183     0.800000       399400         5.00
       4.255     0.825000       412191         5.71
       4.327     0.850000       424307         6.67
       4.411     0.875000       436756         8.00
       4.455     0.887500       442787         8.89
       4.503     0.900000       448939        10.00
       4.559     0.912500       455423        11.43
       4.615     0.925000       461404        13.33
       4.687     0.937500       467684        16.00
       4.727     0.943750       470769        17.78
       4.775     0.950000       473931        20.00
       4.827     0.956250       477021        22.86
       4.887     0.962500       480226        26.67
       4.955     0.968750       483177        32.00
       5.003     0.971875       484857        35.56
       5.051     0.975000       486311        40.00
       5.107     0.978125       487886        45.71
       5.183     0.981250       489453        53.33
       5.287     0.984375       490987        64.00
       5.363     0.985938       491765        71.11
       5.459     0.987500       492532        80.00
       5.627     0.989062       493324        91.43
       5.975     0.990625       494092       106.67
       6.547     0.992188       494868       128.00
       6.855     0.992969       495256       142.22
       7.179     0.993750       495643       160.00
       7.495     0.994531       496040       182.86
       7.779     0.995313       496423       213.33
       8.107     0.996094       496815       256.00
       8.263     0.996484       497011       284.44
       8.439     0.996875       497207       320.00
       8.639     0.997266       497400       365.71
       8.855     0.997656       497593       426.67
       9.039     0.998047       497790       512.00
       9.135     0.998242       497887       568.89
       9.223     0.998437       497987       640.00
       9.327     0.998633       498083       731.43
       9.455     0.998828       498182       853.33
       9.575     0.999023       498277      1024.00
       9.623     0.999121       498328      1137.78
       9.671     0.999219       498371      1280.00
       9.759     0.999316       498423      1462.86
       9.847     0.999414       498470      1706.67
       9.951     0.999512       498518      2048.00
      10.007     0.999561       498541      2275.56
      10.071     0.999609       498567      2560.00
      10.159     0.999658       498591      2925.71
      10.239     0.999707       498615      3413.33
      10.351     0.999756       498639      4096.00
      10.399     0.999780       498651      4551.11
      10.447     0.999805       498663      5120.00
      10.527     0.999829       498676      5851.43
      10.631     0.999854       498687      6826.67
      10.735     0.999878       498700      8192.00
      10.807     0.999890       498707      9102.22
      10.887     0.999902       498712     10240.00
      11.039     0.999915       498718     11702.86
      11.119     0.999927       498724     13653.33
      11.167     0.999939       498730     16384.00
      11.247     0.999945       498733     18204.44
      11.303     0.999951       498736     20480.00
      11.463     0.999957       498739     23405.71
      11.575     0.999963       498742     27306.67
      11.639     0.999969       498745     32768.00
      11.719     0.999973       498747     36408.89
      11.823     0.999976       498748     40960.00
      11.919     0.999979       498750     46811.43
      12.063     0.999982       498751     54613.33
      12.271     0.999985       498753     65536.00
      12.311     0.999986       498754     72817.78
      12.311     0.999988       498754     81920.00
      12.359     0.999989       498755     93622.86
      12.367     0.999991       498756    109226.67
      12.495     0.999992       498757    131072.00
      12.495     0.999993       498757    145635.56
      12.495     0.999994       498757    163840.00
      12.591     0.999995       498758    187245.71
      12.591     0.999995       498758    218453.33
      13.023     0.999996       498759    262144.00
      13.023     0.999997       498759    291271.11
      13.023     0.999997       498759    327680.00
      13.023     0.999997       498759    374491.43
      13.023     0.999998       498759    436906.67
      13.223     0.999998       498760    524288.00
      13.223     1.000000       498760          inf
#[Mean    =        3.301, StdDeviation   =        1.103]
#[Max     =       13.216, Total count    =       498760]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  599428 requests in 1.00m, 97.18MB read
Requests/sec:   9990.17
Transfer/sec:      1.62MB