results/data/run1/native-db/erik-laptop/quarkus-io-thread-15000-WARM-UP.wrk2.out
Running 1m test @ http://erik-pc.local:8080/fruits
  4 threads and 100 connections
  Thread calibration: mean lat.: 2.445ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.485ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.445ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.496ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.41ms    2.08ms  25.87ms   92.77%
    Req/Sec     3.96k   719.84     9.11k    86.35%
  899107 requests in 1.00m, 145.77MB read
Requests/sec:  14985.26
Transfer/sec:      2.43MB