results/data/run1/native-db/erik-laptop/quarkus-worker-pool-12000-WARM-UP.wrk2.out
Running 1m test @ http://erik-pc.local:8080/fruits
  4 threads and 100 connections
  Thread calibration: mean lat.: 14.983ms, rate sampling interval: 79ms
  Thread calibration: mean lat.: 13.487ms, rate sampling interval: 75ms
  Thread calibration: mean lat.: 14.066ms, rate sampling interval: 76ms
  Thread calibration: mean lat.: 16.226ms, rate sampling interval: 81ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    17.35ms   16.24ms  74.75ms   69.02%
    Req/Sec     3.02k   808.41     4.68k    64.61%
  716484 requests in 1.00m, 116.16MB read
Requests/sec:  11941.42
Transfer/sec:      1.94MB